{"config": {"output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 200, 200, 3]}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"filters": 16, "kernel_regularizer": null, "padding": "valid", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "name": "conv2d_1"}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"dtype": "float32", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"filters": 32, "kernel_regularizer": null, "padding": "valid", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "name": "conv2d_2"}, "class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"dtype": "float32", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"filters": 64, "kernel_regularizer": null, "padding": "valid", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "data_format": "channels_last", "name": "conv2d_3"}, "class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"dtype": "float32", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"trainable": true, "dtype": "float32", "name": "flatten_1"}, "class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 512, "activity_regularizer": null, "dtype": "float32", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "name": "dense_1"}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"dtype": "float32", "seed": null, "rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 6, "activity_regularizer": null, "dtype": "float32", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "softmax", "name": "dense_2"}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.5-tf"}